public class Lab2Ex8 {
    /* Шаблоны проектирования - это повторно используемые решения для часто встречающихся задач в программировании.
     например Фабричный метод.

     Готовые Библиотеки классов

     Аннотации (Annotations) - это механизм, позволяющий добавлять метаданные к коду,
     которые могут использоваться для автоматической генерации кода или для предоставления дополнительной информации о коде.
     В Java есть множество предопределенных аннотаций, таких как @Override, @Deprecated и т.д.
     */

}
